docs/fileing files/ECF Operations/ReviewFiling/Riverside Superior Court/Subsequent Filing/Any first paper document for multiple parties, one defendant with Fee Waiver request, other defendant paid Sample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://niem.gov/niem/niem-core/2.0" xmlns:ns10="urn:com.journaltech:ecourt:ecf:extension:TelephoneNumberExt" xmlns:ns11="urn:com.journaltech:ecourt:ecf:extension:CaseParticipantExt" xmlns:ns12="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:ns13="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:ns14="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns15="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:ns16="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:ns17="com.journaltech.niem.test" xmlns:ns2="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:ns3="http://niem.gov/niem/domains/jxdm/4.0" xmlns:ns4="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:ns5="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:ns6="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:ns7="urn:un:unece:uncefact:data:specification:UnqualifiedDataTypesSchemaModule:2" xmlns:ns8="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:ns9="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ns16:ReviewFilingRequestMessage>
         <ns2:SendingMDELocationID>
            <ns1:IdentificationID>YOUR_ENDPOINT_HERE</ns1:IdentificationID>
            <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
         </ns2:SendingMDELocationID>
         <ns6:CoreFilingMessage xsi:type="ns12:CoreFilingMessageExtType">
            <ns1:DocumentFiledDate id="ref1">
               <ns1:DateTime>2021-06-10T13:12:02-07:00</ns1:DateTime>
            </ns1:DocumentFiledDate>
            <ns1:DocumentIdentification>
               <ns1:IdentificationID>YOUR_IDENTIFICATIONID_HERE</ns1:IdentificationID>
            </ns1:DocumentIdentification>
            <ns1:Case xsi:type="ns5:CivilCaseTypeExt">
               <ns1:CaseDocketID>CASEDOCKETID_HERE</ns1:CaseDocketID>
               <a:CaseAugmentation xmlns:a="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0">
                  <p:CaseParticipantExt xmlns:p="urn:com.journaltech:ecourt:ecf:extension:CaseParticipantExt" xmlns:st="http://niem.gov/niem/structures/2.0" st:id="3814995"/>
               </a:CaseAugmentation>
               <ns5:Complaint xmlns:st="http://niem.gov/niem/structures/2.0" st:id="1065535"/>
               <ns5:CaseAugmentationExt>
                  <ns3:CaseCourt>
                     <ns1:OrganizationIdentification>
                        <ns1:IdentificationID>efm-riv.journaltech.com</ns1:IdentificationID>
                        <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
                     </ns1:OrganizationIdentification>
                     <ns3:CourtName>Riverside Superior Court</ns3:CourtName>
                  </ns3:CaseCourt>
                  <ns5:relatedParticipantDocuments>
                     <ns5:associationType>FILEDBY</ns5:associationType>
                     <ns5:participant xmlns:st="http://niem.gov/niem/structures/2.0" st:ref="3814995"/>
                     <ns5:relatedDocument xmlns:st="http://niem.gov/niem/structures/2.0" st:ref="doc1"/>
                  </ns5:relatedParticipantDocuments>
               </ns5:CaseAugmentationExt>
            </ns1:Case>
            <ns6:FilingLeadDocument xmlns:st="http://niem.gov/niem/structures/2.0" complaintType="1065535" st:id="doc0" xsi:type="ns12:DocumentExtType">
               <ns1:DocumentBinary>
                  <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
                  <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
               </ns1:DocumentBinary>
               <ns1:DocumentDescriptionText>ANS</ns1:DocumentDescriptionText>
               <ns1:DocumentFileControlID>12473</ns1:DocumentFileControlID>
               <ns1:DocumentIdentification>
                  <ns1:IdentificationID>ANS</ns1:IdentificationID>
                  <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
               </ns1:DocumentIdentification>
               <ns9:DocumentFilingMetaData>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>FILED_BY</ns8:code>
                        <ns8:classType>caseParticipant</ns8:classType>
                        <ns8:subType>filed-by</ns8:subType>
                        <ns8:valueRestriction>existing-data</ns8:valueRestriction>
                     </ns9:docValueMetaDataItem>
                     <ns9:idReferences>
                        <ns9:id>3814995</ns9:id>
                        <ns9:additionalInfoTags>
                           <ns9:tagType>FEE_EXEMPTION</ns9:tagType>
                           <ns9:tagValue>FEE_WAIVER</ns9:tagValue>
                        </ns9:additionalInfoTags>
                     </ns9:idReferences>
                     <ns9:idReferences>
                        <ns9:id>3814996</ns9:id>
                     </ns9:idReferences>
                  </ns9:documentFilingMetaDataItem>
                  <ns9:documentFilingMetaDataItem>
                     <ns9:docValueMetaDataItem>
                        <ns8:code>NEW_ATTORNEY</ns8:code>
                        <ns8:classType>attorney</ns8:classType>
                        <ns8:subType>filed-by</ns8:subType>
                        <ns8:valueRestriction>new-data</ns8:valueRestriction>
                     </ns9:docValueMetaDataItem>
                     <ns9:attorneyValue>
                        <ns2:EntityPerson id="ref2">
                           <ns1:PersonName>
                              <ns1:PersonGivenName>Douglas</ns1:PersonGivenName>
                              <ns1:PersonMiddleName>Wharton</ns1:PersonMiddleName>
                              <ns1:PersonSurName>Alexander</ns1:PersonSurName>
                           </ns1:PersonName>
                           <ns1:PersonOtherIdentification>
                              <ns1:IdentificationID>098894</ns1:IdentificationID>
                              <ns1:IdentificationCategoryText>BAR</ns1:IdentificationCategoryText>
                           </ns1:PersonOtherIdentification>
                        </ns2:EntityPerson>
                        <ns2:EntityOrganization id="ref3">
                           <ns1:OrganizationName>Alexander Duboce Jones &amp;amp; Townsend LLP</ns1:OrganizationName>
                        </ns2:EntityOrganization>
                        <ns2:CaseParticipantRoleCode>ATT</ns2:CaseParticipantRoleCode>
                        <ns1:ContactInformation>
                           <sa1:ContactMailingAddress xmlns:sa1="http://niem.gov/niem/niem-core/2.0">
                              <sta1:StructuredAddress xmlns:sta1="urn:com.journaltech:ecourt:ecf:extension:StructuredAddressExt">
                                 <sta1:LocationType>BUS</sta1:LocationType>
                                 <sa1:LocationCountryName>US</sa1:LocationCountryName>
                                 <sa1:AddressDeliveryPoint xsi:type="sa1:StreetType">
                                    <sa1:StreetFullText>515 Congress Ave #2350</sa1:StreetFullText>
                                 </sa1:AddressDeliveryPoint>
                                 <sa1:LocationCityName>Austin</sa1:LocationCityName>
                                 <sa1:LocationStateName>TX</sa1:LocationStateName>
                                 <sa1:LocationState>TX</sa1:LocationState>
                                 <sa1:LocationPostalCode>78701</sa1:LocationPostalCode>
                              </sta1:StructuredAddress>
                           </sa1:ContactMailingAddress>
                           <ns1:ContactTelephoneNumber>
                              <ns10:TelephoneNumberInformation>
                                 <ns1:TelephoneNumberFullID>5124829300</ns1:TelephoneNumberFullID>
                                 <ns10:TelephoneNumberFullType>W</ns10:TelephoneNumberFullType>
                              </ns10:TelephoneNumberInformation>
                           </ns1:ContactTelephoneNumber>
                           <ns1:ContactEmailID>Void@void.com</ns1:ContactEmailID>
                        </ns1:ContactInformation>
                     </ns9:attorneyValue>
                  </ns9:documentFilingMetaDataItem>
               </ns9:DocumentFilingMetaData>
            </ns6:FilingLeadDocument>
            <ns6:FilingConnectedDocument xmlns:st="http://niem.gov/niem/structures/2.0" st:id="doc1" xsi:type="ns12:DocumentExtType">
               <ns1:DocumentBinary>
                  <ns1:BinaryFormatStandardName xsi:type="ns7:TextType">application/pdf</ns1:BinaryFormatStandardName>
                  <ns1:BinaryLocationURI>YOUR_URL_HERE</ns1:BinaryLocationURI>
               </ns1:DocumentBinary>
               <ns1:DocumentDescriptionText>REWCF</ns1:DocumentDescriptionText>
               <ns1:DocumentFileControlID>12475</ns1:DocumentFileControlID>
               <ns1:DocumentIdentification>
                  <ns1:IdentificationID>REWCF</ns1:IdentificationID>
                  <ns1:IdentificationSourceText>RSCR</ns1:IdentificationSourceText>
               </ns1:DocumentIdentification>
               <ns9:DocumentFilingMetaData/>
            </ns6:FilingConnectedDocument>
         </ns6:CoreFilingMessage>
         <ns13:PaymentMessage xsi:type="ns15:PaymentMessageTypeExt">
            <ns15:paymentAuthorizationInfo>
               <ns15:customerProfileId>0</ns15:customerProfileId>
               <ns15:customerPaymentProfileId>0</ns15:customerPaymentProfileId>
               <ns15:paymentType>ACH</ns15:paymentType>
            </ns15:paymentAuthorizationInfo>
         </ns13:PaymentMessage>
      </ns16:ReviewFilingRequestMessage>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>